In [319]:
import pandas as pd

In [320]:
import numpy as np
import itertools as it

In [321]:
data = pd.read_csv('/Users/jlangley/Downloads/district.csv')

In [322]:
data.index.values

array([0, 1, 2, 3, 4, 5, 6, 7])

In [324]:
data2[data2['group'].isnull()]

,school_name,total_enrollment,isp_students,monthly_lunches_served,monthly_breakfast_served,ind,index_cumsum,group
0,Mira Mesa HS,3400,1800,3000,2000,0,[0],NaN
3,Mira Mesa HS4,3400,1300,3000,2000,3,"[0, 1, 2, 3]",NaN
4,Mira Mesa HS5,3400,1400,3000,2000,4,"[0, 1, 2, 3, 4]",NaN
5,Mira Mesa HS6,3400,1500,3000,2000,5,"[0, 1, 2, 3, 4, 5]",NaN
6,Mira Mesa HS7,3400,1600,3000,2000,6,"[0, 1, 2, 3, 4, 5, 6]",NaN
7,Mira Mesa HS8,3400,1700,3000,2000,7,"[0, 1, 2, 3, 4, 5, 6, 7]",NaN

In [316]:
indexes_to_try = [6,7]
for itry in it.combinations(indexes_to_try, i):
    data2 = data.iloc[list(set([*itry, *indexes_to_try]))]

In [317]:
data2.loc[[1,2], 'group'] = 1

In [318]:
data2.head()

,school_name,total_enrollment,isp_students,monthly_lunches_served,monthly_breakfast_served,ind,index_cumsum,group
0,Mira Mesa HS,3400,1800,3000,2000,0,[0],NaN
1,Mira Mesa HS2,3400,1100,3000,2000,1,"[0, 1]",1.0
2,Mira Mesa HS3,3400,1200,3000,2000,2,"[0, 1, 2]",1.0
3,Mira Mesa HS4,3400,1300,3000,2000,3,"[0, 1, 2, 3]",NaN
4,Mira Mesa HS5,3400,1400,3000,2000,4,"[0, 1, 2, 3, 4]",NaN

In [261]:
data2_cumsum= data[data.group.isnull()].cumsum()
data2_cumsum['isp_percent'] = data2_cumsum.isp_students / data2_cumsum.total_enrollment
data2_cumsum.sort_values('isp_percent', ascending=False, inplace=True)
data2_cumsum

,school_name,total_enrollment,isp_students,monthly_lunches_served,monthly_breakfast_served,ind,index_cumsum,group,isp_percent
0,Mira Mesa HS,3400,1800,3000,2000,0,[0],NaN,0.529412
3,Mira Mesa HSMira Mesa HS4,6800,3100,6000,4000,3,"[0, 0, 1, 2, 3]",NaN,0.455882
7,Mira Mesa HSMira Mesa HS4Mira Mesa HS5Mira Mes...,20400,9300,18000,12000,25,"[0, 0, 1, 2, 3, 0, 1, 2, 3, 4, 0, 1, 2, 3, 4, ...",NaN,0.455882
6,Mira Mesa HSMira Mesa HS4Mira Mesa HS5Mira Mes...,17000,7600,15000,10000,18,"[0, 0, 1, 2, 3, 0, 1, 2, 3, 4, 0, 1, 2, 3, 4, ...",NaN,0.447059
4,Mira Mesa HSMira Mesa HS4Mira Mesa HS5,10200,4500,9000,6000,7,"[0, 0, 1, 2, 3, 0, 1, 2, 3, 4]",NaN,0.441176
5,Mira Mesa HSMira Mesa HS4Mira Mesa HS5Mira Mes...,13600,6000,12000,8000,12,"[0, 0, 1, 2, 3, 0, 1, 2, 3, 4, 0, 1, 2, 3, 4, 5]",NaN,0.441176

In [262]:
data2_cumsum.drop('index_cumsum', axis=1)

,school_name,total_enrollment,isp_students,monthly_lunches_served,monthly_breakfast_served,ind,group,isp_percent
0,Mira Mesa HS,3400,1800,3000,2000,0,NaN,0.529412
3,Mira Mesa HSMira Mesa HS4,6800,3100,6000,4000,3,NaN,0.455882
7,Mira Mesa HSMira Mesa HS4Mira Mesa HS5Mira Mes...,20400,9300,18000,12000,25,NaN,0.455882
6,Mira Mesa HSMira Mesa HS4Mira Mesa HS5Mira Mes...,17000,7600,15000,10000,18,NaN,0.447059
4,Mira Mesa HSMira Mesa HS4Mira Mesa HS5,10200,4500,9000,6000,7,NaN,0.441176
5,Mira Mesa HSMira Mesa HS4Mira Mesa HS5Mira Mes...,13600,6000,12000,8000,12,NaN,0.441176

In [306]:
data2_cumsum.reset_index(inplace=True)
data2_cumsum.set_index(['group','school_name', data2_cumsum.index], inplace=True)

In [307]:
data2_cumsum.loc[(data2_cumsum.index.get_level_values('group').isnull())].index

MultiIndex(levels=[[], ['Mira Mesa HS', 'Mira Mesa HSMira Mesa HS4', 'Mira Mesa HSMira Mesa HS4Mira Mesa HS5', 'Mira Mesa HSMira Mesa HS4Mira Mesa HS5Mira Mesa HS6', 'Mira Mesa HSMira Mesa HS4Mira Mesa HS5Mira Mesa HS6Mira Mesa HS7', 'Mira Mesa HSMira Mesa HS4Mira Mesa HS5Mira Mesa HS6Mira Mesa HS7Mira Mesa HS8'], [0, 1, 2, 3, 4, 5]],
           labels=[[-1, -1, -1, -1, -1, -1], [0, 1, 5, 4, 2, 3], [0, 1, 2, 3, 4, 5]],
           names=['group', 'school_name', None])

In [193]:
data2.drop(['group'],axis=1, inplace=True)

In [194]:
data2.head()

,school_name,total_enrollment,isp_students,monthly_lunches_served,monthly_breakfast_served,ind,index_cumsum
0,Mira Mesa HS,3400,1800,3000,2000,0,[0]
1,Mira Mesa HS2,3400,1100,3000,2000,1,"[0, 1]"
2,Mira Mesa HS3,3400,1200,3000,2000,2,"[0, 1, 2]"
3,Mira Mesa HS4,3400,1300,3000,2000,3,"[0, 1, 2, 3]"
4,Mira Mesa HS5,3400,1400,3000,2000,4,"[0, 1, 2, 3, 4]"

In [60]:
from sklearn.cluster import KMeans

In [61]:
data['idx'] = data.index.values
data['isp_percent'] = data.isp_students/ data.total_enrollment
the_rest = set(data.index.values)-set([1,2])
km = KMeans(n_clusters=3, random_state=0).fit(data[['idx', 'isp_percent']])

In [62]:
km.labels_

array([2, 2, 1, 1, 1, 0, 0, 0], dtype=int32)

In [70]:
data.idx.values

array([0, 1, 2, 3, 4, 5, 6, 7])

I need to put in 2 or more combinatoric blocks.
One is at the 100% level
after a isp_sort you will get a difference between 62.5 and the currrent level.
One is filling an existing void with a small size school or two.  Using calculations of extending the trend line.
do the same for existing group - 1 Schools from the bottom 2
do the same for existing group - 2 Schools
keep a list of unique sets possibilities
Only keep 1 possibility
This will give the 100% group

The last is is above 30% taking the remaining schools sorting them into ip_cumsum_sort and recalculating and seeing which schools can stay while being responsible to the schools who need it

In [ ]:
val = 0#get with rough_100_percent cumsum.tail(1)
for combos in it.combinations(not_rough_100_percent_indexes):
    df = concat([val,data.loc[combos]])
    df
    
    #add that to

In [85]:
indexes_to_try = data.idx.values
data2 = 0
possibilities = pd.DataFrame(columns = [''])

In [87]:
def brute_force(indexes_to_try):
    rv = []
    for i in range(7):
        for itry in it.combinations(indexes_to_try, i):
            data2 = data.loc([*itry, *indexes_to_try])
            data2 = isp_sort(data2)
            data2.cumsum(inplace=True)
            data2.isp_percent = data2.isp_people / data2.total_enrollment
            if data2.isp_percent.tail(1).values > config.max_cep_thold_pct():
                rv.append(data2.indexes.values)
    return rv

In [89]:
def best_of(indexes_to_try):
    try_em = brute_force(indexes_to_try)
    values = [data.loc[x].total_enrollment.sum() for x in try_em]
    return try_em[max(xrange(len(values), key=values.__getitem__))]